Meshes & Solutions/polygon-32/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          56;
        startFace       14496;
    }
    outlet
    {
        type            patch;
        nFaces          56;
        startFace       14552;
    }
    polygon
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          64;
        startFace       14608;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          7360;
        startFace       14672;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          7360;
        startFace       22032;
    }
    outside
    {
        type            patch;
        nFaces          272;
        startFace       29392;
    }
)

// ************************************************************************* //
